src/app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources" WHERE (user_id IS NOT NULL)
---
  def index
    render json: ActiveModel::ArraySerializer.new(
      Resource.all,
      each_serializer: ResourceSerializer
    ).to_json

SELECT "resources".* FROM "resources" WHERE "resources"."user_id" = ?  [["user_id", 1]]
---
  def lease
    return respond_409('You cannot lease more than 1 server at a time') if Resource.leased_to_user(@user).present?